#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");

	int m;
	int K = 364;        // задаем день		
	int N = 7;        // первый день недели в году	
	m = ((K + N - 2) % 7) + 1;          /*Если бы первый день приходился на понедельник (1),
                                          то для определения дня недели для K-го дня года достаточно взять
                                          ((K-1) % 7) + 1. Но так как 1-й день года приходится на день N, то
                                          к K-1 прибавляем N-1*/
	cout << "номер дня недели:" << m;
	return 0;
}

